[ {"conflictID":1,"conflictName":"American Civil War","conflictLocation":{"long":-80.95,"lat":33.63},"conflictStart":"1861-04-12","conflictEnd":"1865-05-09","conflictDescription":"The American Civil War was fought from 1861 to 1865. Seven Southern slave states individually declared their secession from the United States and formed the Confederate States of America, known as the Confederacy or the South. They grew to include eleven states, and although they claimed thirteen states and additional western territories, the Confederacy was never recognized by a foreign country. The states that did not declare secession were known as the Union or the North. The war had its origin in the fractious issue of slavery, especially the extension of slavery into the western territories. After four years of bloody combat that left over 600,000 Union and Confederate soldiers dead, and destroyed much of the South's infrastructure, the Confederacy collapsed, slavery was abolished, and the difficult Reconstruction process of restoring national unity and guaranteeing civil rights to the freed slaves began.","conflictDead":625000,"conflictWounded":410000,"conflictImgName":"americancivilwar.jpg","conflictRegime":{"regimeID":4,"regimeName":"Democracy","regimeLeader":"James Buchanan","regimeDescription":null},"conflictType":{"typeID":1,"typeName":"Civil War"},"conflictCountries":[{"countryID":237,"countryName":"United States"}],"conflictWeapons":[{"weaponID":1,"weaponName":"M1860 Cutlass","weaponDeveloped":"1860-01-01","weaponDescription":"Issued to naval boarding parties. Sailors als","weaponIMG":"cutlass.jpg","weaponCountry":{"countryID":237,"countryName":"United States"}},{"weaponID":2,"weaponName":"Model 1832 Foot Artillery Sword","weaponDeveloped":"1832-01-01","weaponDescription":"Issued to artillerymen. Based on the Roman gladius.","weaponIMG":"1832sword.jpg","weaponCountry":{"countryID":237,"countryName":"United States"}}]},{"conflictID":2,"conflictName":"Anti-Rightist Movement","conflictLocation":{"long":116.39,"lat":39.91},"conflictStart":"1957-01-01","conflictEnd":"1959-01-01","conflictDescription":"People who had been critical of his regime and ideology were labeled rightists and were persecuted. Many believe that the whole purpose of the Hundred Flowers Movement was to flush out dissidents. Mao himself even said that he had, enticed the snakes out of their caves. About half a million intellectuals, students, officials, artists, and dissidents were persecuted by being imprisoned or sent to labor camps.","conflictDead":0,"conflictWounded":550000,"conflictImgName":"antirightist.jpg","conflictRegime":{"regimeID":2,"regimeName":"Communist Party of China","regimeLeader":"Mao Zedong","regimeDescription":"The Hundred Flowers Campaign was a period during which the Communist Party of China encouraged its citizens to openly express their opinions of the communist regime. Differing views and solutions to national policy were encouraged based on the famous expression by Mao Zedong: The policy of letting a hundred flowers bloom and a hundred schools of thought contend is designed to promote the flourishing of the arts and the progress of science. Therafter Mao abruptly changed course. The crackdown continued as an Anti-Rightist Campaign against those who were critical of the regime and its ideology. Those targeted were publicly criticized, condemned to prison labor camps and in many cases executed."},"conflictType":{"typeID":10,"typeName":"War of succession"},"conflictCountries":[{"countryID":46,"countryName":"China"}],"conflictWeapons":[]},{"conflictID":3,"conflictName":"World War II","conflictLocation":{"long":13.38,"lat":52.52},"conflictStart":"1939-09-01","conflictEnd":"1945-09-02","conflictDescription":"The war in Europe began in September 1939, when Germany, under Chancellor Adolf Hitler, invaded Poland. Britain and France responded by declaring war on Germany but took little action over the following months. In 1940, Germany launched its next initiative by attacking Denmark and Norway, followed shortly thereafter by attacks on Belgium, the Netherlands, and France. All of these nations were conquered rapidly.","conflictDead":73000000,"conflictWounded":26540408,"conflictImgName":"ww2.jpg","conflictRegime":{"regimeID":1,"regimeName":"Nazi Germany","regimeLeader":"Adolf Hitler","regimeDescription":"Nazi Germany and the Third Reich are common names for Germany during the period from 1933 to 1945, when its government was controlled by Adolf Hitler and his National Socialist German Workers Party (NSDAP), commonly known as the Nazi Party. Under Hitler s rule, Germany was transformed into a fascist totalitarian state which controlled nearly all aspects of life. Nazi Germany ceased to exist after the Allied Forces defeated Germany in May 1945, ending World War II in Europe."},"conflictType":{"typeID":10,"typeName":"War of succession"},"conflictCountries":[],"conflictWeapons":[]},{"conflictID":4,"conflictName":"Spanish Glorious Revolution","conflictLocation":{"long":-3.6,"lat":40.42},"conflictStart":"1868-09-19","conflictEnd":"1868-09-27","conflictDescription":"In 1833, the death of Fernando VII had brought three-year-old Isabel II to the throne. As time passed, it became clear that Isabel, who had been forcibly married to homosexual Francisco de Asis, had no interest in politics, being influenced by many people and allowing many coups and countercoups to happen, which meant that political life came to be dominated by military men, which, during most of the decades of 1850 and 1860, meant the Moderate Party and Ramon Maria Narvaez, which further isolated Isabel II from the realities of life and of the Spanish liberal movement that had supported her when she was a child.","conflictDead":1500,"conflictWounded":0,"conflictImgName":"spanishgloriousrevolution.jpg","conflictRegime":{"regimeID":3,"regimeName":"Monarchy","regimeLeader":"Queen Isabella II","regimeDescription":null},"conflictType":{"typeID":1,"typeName":"Civil War"},"conflictCountries":[{"countryID":209,"countryName":"Spain"}],"conflictWeapons":[{"weaponID":3,"weaponName":"Broadsword","weaponDeveloped":"1545-01-01","weaponDescription":"The basket hilt is a development of the quillons added to swords crossguards since the Late Middle Ages. Also known as the broadsword.","weaponIMG":"broadsword.jpg","weaponCountry":{"countryID":236,"countryName":"United Kingdom"}},{"weaponID":4,"weaponName":"Lochaber axe","weaponDeveloped":"1570-01-01","weaponDescription":"The Lochaber axe is a type of halberd. The axe itself is similar to tools used with crops, such as the scythe, which is designed for reaping.","weaponIMG":"lochaber.jpg","weaponCountry":{"countryID":236,"countryName":"United Kingdom"}}]},{"conflictID":5,"conflictName":"World War I","conflictLocation":{"long":13.38,"lat":52.52},"conflictStart":"1914-07-28","conflictEnd":"1918-11-11","conflictDescription":"Following the assassination of Archduke Franz Ferdinand of Austria-Hungary on 28 June 1914, Wilhelm and his Chancellor, Theobald von Bethmann-Hollweg, incited Austria-Hungary to exact revenge against Serbia.  Events spiralled throughout July resulting in the First World War (click here to read Wilhelm's views of the Austro-Hungarian ultimatum).  Wilhelm appeared not to foresee the consequences of an Austro-Hungarian attack on Serbia, pulling France, Russia and Britain into the war.  Too late he attempted to scale back German involvement: he was firmly dissuaded by the German military.","conflictDead":9911000,"conflictWounded":21219500,"conflictImgName":"ww1.jpg","conflictRegime":{"regimeID":5,"regimeName":"Monarch Prussia","regimeLeader":"Wilhelm II","regimeDescription":"Following the assassination of Archduke Franz Ferdinand of Austria-Hungary on 28 June 1914, Wilhelm and his Chancellor, Theobald von Bethmann-Hollweg, incited Austria-Hungary to exact revenge against Serbia.  Events spiralled throughout July resulting in the First World War (click here to read Wilhelm his views of the Austro-Hungarian ultimatum).  Wilhelm appeared not to foresee the consequences of an Austro-Hungarian attack on Serbia, pulling France, Russia and Britain into the war.  Too late he attempted to scale back German involvement: he was firmly dissuaded by the German military.  (Click here to read Wilhelm his account of the events of July 1914.)"},"conflictType":{"typeID":7,"typeName":"Invasion"},"conflictCountries":[{"countryID":5,"countryName":"Andorra"},{"countryID":11,"countryName":"Armenia"},{"countryID":23,"countryName":"Belgium"},{"countryID":32,"countryName":"Brazil"},{"countryID":46,"countryName":"China"},{"countryID":54,"countryName":"Costa Rica"},{"countryID":57,"countryName":"Cuba"},{"countryID":60,"countryName":"Czech Republic"},{"countryID":203,"countryName":"Slovakia"},{"countryID":77,"countryName":"France"},{"countryID":88,"countryName":"Greece"},{"countryID":94,"countryName":"Guatemala"},{"countryID":98,"countryName":"Haiti"},{"countryID":100,"countryName":"Honduras"},{"countryID":111,"countryName":"Italy"},{"countryID":113,"countryName":"Japan"},{"countryID":119,"countryName":"Korea, North"},{"countryID":120,"countryName":"Korea, South"},{"countryID":218,"countryName":"Taiwan"},{"countryID":128,"countryName":"Liberia"},{"countryID":151,"countryName":"Montenegro"},{"countryID":158,"countryName":"Nepal"},{"countryID":163,"countryName":"Nicaragua"},{"countryID":174,"countryName":"Panama"},{"countryID":181,"countryName":"Portugal"},{"countryID":185,"countryName":"Romania"},{"countryID":186,"countryName":"Russia"},{"countryID":187,"countryName":"Russia"},{"countryID":199,"countryName":"Serbia and Montenegro"},{"countryID":221,"countryName":"Thailand"},{"countryID":236,"countryName":"United Kingdom"},{"countryID":40,"countryName":"Canada"},{"countryID":33,"countryName":"British Indian Ocean Territory"},{"countryID":14,"countryName":"Australia"},{"countryID":162,"countryName":"New Zealand"},{"countryID":140,"countryName":"Malta"},{"countryID":207,"countryName":"South Africa"},{"countryID":251,"countryName":"Zambia"},{"countryID":251,"countryName":"Zambia"},{"countryID":178,"countryName":"Philippines"}],"conflictWeapons":[]},{"conflictID":6,"conflictName":"The Iraq war","conflictLocation":{"long":33.294613,"lat":44.3847441},"conflictStart":"2003-03-20","conflictEnd":"2011-12-15","conflictDescription":"The Iraq War was an armed conflict in Iraq that consisted of two phases. The first was an invasion of Iraq starting on March 20 2003 by an invasion force led by the United States United Kingdom Australia and Poland which resulted in the end of Baathist Iraq and the establishment of a democratic constitution. It was followed by a longer phase of fighting, in which an insurgency emerged opposing the occupying forces and the newly elected Federal government of Iraq. Roughly 96.5 percent of the casualties suffered by coalition forces were suffered during the second phase rather than the initial invasion. The U.S. completed its withdrawal of military personnel in December 2011 during the ninth year of the war. However the insurgency is ongoing and continues to cause thousands of fatalities.","conflictDead":62630,"conflictWounded":117961,"conflictImgName":"iraqWar.jpg","conflictRegime":{"regimeID":6,"regimeName":"Ba ath-party","regimeLeader":"Saddam Hoessein","regimeDescription":"Saddam formally rose to power in 1979 although he had been the de facto head of Iraq for several years prior. He suppressed several movements particularly Shia and Kurdish movements seeking to overthrow the government or gain independence and maintained power during the Iran Iraq War and the Gulf War. Whereas some venerated Saddam for his opposition to Israel which included the use of military force he was widely condemned in the west for the brutality of his dictatorship."},"conflictType":{"typeID":7,"typeName":"Invasion"},"conflictCountries":[{"countryID":237,"countryName":"United States"},{"countryID":236,"countryName":"United Kingdom"},{"countryID":180,"countryName":"Poland"},{"countryID":14,"countryName":"Australia"}],"conflictWeapons":[{"weaponID":5,"weaponName":"AK-47","weaponDeveloped":"1947-01-01","weaponDescription":"The AK-47 is a selective-fire gas-operated 7.62x39mm assault rifle first developed in the Soviet Union by Mikhail Kalashnikov.","weaponIMG":"ak47.jpg","weaponCountry":{"countryID":186,"countryName":"Russia"}},{"weaponID":6,"weaponName":"M16A2","weaponDeveloped":"1980-01-01","weaponDescription":"The development of the M16A2 rifle was originally requested by the United States Marine Corps as a result of the USMCs combat experience in Vietnam with the XM16E1 and M16A1.","weaponIMG":"m16a2.jpg","weaponCountry":{"countryID":237,"countryName":"United States"}}]},{"conflictID":7,"conflictName":"Second Sino-Japanese war","conflictLocation":{"long":136.4664008,"lat":37.4900318},"conflictStart":"1937-07-07","conflictEnd":"1945-09-09","conflictDescription":"The war was the result of a decades-long Japanese imperialist policy aiming to dominate China politically and militarily and to secure its vast raw material reserves and other economic resources particularly food and labour. Before 1937 China and Japan fought in small localized engagements so-called incidents. In 1931 the Japanese invasion of Manchuria by Japans Kwantung Army followed the Mukden Incident. The last of these incidents was the Marco Polo Bridge Incident of 1937 marking the beginning of total war between the two countries.","conflictDead":25707000,"conflictWounded":2969200,"conflictImgName":"sino.jpg","conflictRegime":{"regimeID":7,"regimeName":"Empire of Japan","regimeLeader":"Hirohito","regimeDescription":"The Empire of Japan Dai Nippon Teikoku literally Greater Japanese Empire was a parliamentary constitutional monarchy empire and world power that existed from the Meiji Restoration on January 3 1868 to the enactment of the 1947 constitution of modern Japan."},"conflictType":{"typeID":5,"typeName":"Corporate war"},"conflictCountries":[{"countryID":46,"countryName":"China"},{"countryID":237,"countryName":"United States"},{"countryID":187,"countryName":"Russia"},{"countryID":236,"countryName":"United Kingdom"},{"countryID":85,"countryName":"Germany"},{"countryID":113,"countryName":"Japan"}],"conflictWeapons":[{"weaponID":7,"weaponName":"Type 38 rifle","weaponDeveloped":"0000-00-00","weaponDescription":"A bolt-action rifle that supplemented the Type 99 Japanese standard infantry rifle during the Second World War.","weaponIMG":"type38.jpg","weaponCountry":{"countryID":113,"countryName":"Japan"}},{"weaponID":8,"weaponName":"Type 11 37 mm Infantry Support Gun","weaponDeveloped":"0000-00-00","weaponDescription":"The Type 11 designation was given to this gun as it was accepted in the 11th year of Emperor Taishos reign","weaponIMG":"type11.jpg","weaponCountry":{"countryID":113,"countryName":"Japan"}}]},{
    "conflictID": 8,
    "conflictName": "Thousand Days War",
    "conflictLocation": {
        "long": 34.0008,
        "lat": -81.0353
    },
    "conflictStart": "1899-01-01",
    "conflictEnd": "1902-01-01",
    "conflictDescription": "The Thousand Days War (Spanish: Guerra de los Mil Dias), was a civil armed conflict in the newly created Republic of Colombia, (including its then Department of Panama) between the Conservative Party, the Liberal Party and its radical factions. In 1899 the ruling conservatives were accused of maintaining power through fraudulent elections. The situation was worsened by an economic crisis caused by falling coffee prices in the international market. This mainly affected the opposition Liberal Party, which had lost power.",
    "conflictDead": 10000,
    "conflictWounded": 90000,
    "conflictImgName": "thousanddayswar.jpg",
    "conflictRegime": {
        "regimeID": 8,
        "regimeName": "Republic",
        "regimeLeader": "Omar Yepes",
        "regimeDescription": "The Conservative party along with the Colombian Liberal Party dominated the Colombian political scene from the end of the 19th century until 2002, in bipartisan political hegemony. In the mid-20th century, the Conservative Party and the Liberal Party established the National Front after deposing President Gustavo Rojas Pinilla and shared by turns the presidential terms for 16 years."
    },
    "conflictType": {
        "typeID": 1,
        "typeName": "Civil War"
    },
    "conflictCountries": [
        {
            "countryID": 210,
            "countryName": "Columbia"
        }
    ],
    "conflictWeapons": [
        {
            "weaponID": 1,
            "weaponName": "Bridesburg Model 1861",
            "weaponDeveloped": "1861-01-01",
            "weaponDescription": "The Model 1861 was the primary musket at the start of the Civil War. Musket was designed as a single shot.",
            "weaponIMG": "bridesburg.jpg",
            "weaponCountry": {
                "countryID": 237,
                "countryName": "United States"
            }
        },
        {
            "weaponID": 2,
            "weaponName": "Cook and Brother Carbine 1860",
            "weaponDeveloped": "1832-01-01",
            "weaponDescription": "The gun had a very long barrel and was mainly used by the cavalrymen.",
            "weaponIMG": "cookandbrother.jpg",
            "weaponCountry": {
                "countryID": 237,
                "countryName": "United States"
            }
        }
    ]
},

    {
        "conflictID": 9,
        "conflictName": "War of Attrition",
        "conflictLocation": {
            "long": 26.0000,
            "lat": 30.0000
        },
        "conflictStart": "1967-07-01",
        "conflictEnd": "1970-08-07",
        "conflictDescription": "The War of Attrition was a limited war fought between Egypt and Israel 1968-1970. It was initiated by Egypt as a way to make Israels occupation of the Sinai as costly as possible. The war ended with a cease-fire signed between the countries in 1970 with frontiers at the same place as when the war started.",
        "conflictDead": 7500,
        "conflictWounded": 11000,
        "conflictImgName": "warofattrition.jpg",
        "conflictRegime": {
            "regimeID": 9,
            "regimeName": "Revolutionary Command Council",
            "regimeLeader": "Gamal Abdel Nasser Hussein",
            "regimeDescription": "The Revolutionary Command Council (RCC) was the body established to supervise Egypt and Sudan after the Revolution of 1952. It initially selected Ali Maher Pasha as Prime Minister, but forced him to resign after conflict over land reform. At that time, the Council took full control of Egypt."
        },
        "conflictType": {
            "typeID": 9,
            "typeName": "Attrition Warfare"
        },
        "conflictCountries": [
            {
                "countryID": 210,
                "countryName": "Egypt"
            },
            {
                "countryID": 210,
                "countryName": "Jordan"
            }
        ],
        "conflictWeapons": [
            {
                "weaponID": 1,
                "weaponName": "R-3S missiles",
                "weaponDeveloped": "1960-01-01",
                "weaponDescription": "The R-3S was the first version to enter widespread production, in spite of a very long seeker settling time on the order of 22 seconds (as opposed to 11 for the original).",
                "weaponIMG": "r3s.jpg",
                "weaponCountry": {
                    "countryID": 237,
                    "countryName": "Russia"
                }
            }
        ]
    }]